SOAP Country info service.postman_collection.json

{
	"info": {
		"_postman_id": "e1a36ebe-c2d3-4bf7-af7e-41136163bef1",
		"name": "SOAP Country info service",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "43040118",
		"_collection_link": "https://www.postman.com/technical-administrator-59540941/my-test-course-workspace/collection/1qkrrsz/soap-country-info-service?action=share&source=collection_link&creator=43040118"
	},
	"item": [
		{
			"name": "List of continents",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:ListOfContinentsByName></web:ListOfContinentsByName>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "List of currencies by name",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:ListOfCurrenciesByName></web:ListOfCurrenciesByName>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "List of country names by name",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:ListOfCountryNamesByName></web:ListOfCountryNamesByName>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Country name",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:CountryName>\r\n            <web:sCountryISOCode>BY</web:sCountryISOCode>\r\n        </web:CountryName>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Error country ISO code numbers",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:CountryName>\r\n            <web:sCountryISOCode>1111</web:sCountryISOCode>\r\n        </web:CountryName>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Error country ISO code lower case",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:CountryName>\r\n            <web:sCountryISOCode>by</web:sCountryISOCode>\r\n        </web:CountryName>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "500 Error body without closing symbol >",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:CountryName>\r\n            <web:sCountryISOCode>BY</web:sCountryISOCode>\r\n        </web:CountryName>\r\n    </x:Body>\r\n</x:Envelope",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Country ISO code",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:CountryISOCode>\r\n            <web:sCountryName>Belarus</web:sCountryName>\r\n        </web:CountryISOCode>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Error country name is special symbol",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:CountryISOCode>\r\n            <web:sCountryName>@</web:sCountryName>\r\n        </web:CountryISOCode>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Error country name is number",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:CountryISOCode>\r\n            <web:sCountryName>22</web:sCountryName>\r\n        </web:CountryISOCode>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Error country name is space",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:CountryISOCode>\r\n            <web:sCountryName> </web:sCountryName>\r\n        </web:CountryISOCode>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "500 Request without country name",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:CountryISOCode>\r\n            \r\n        </web:CountryISOCode>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Full country info",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:FullCountryInfo>\r\n            <web:sCountryISOCode>BY</web:sCountryISOCode>\r\n        </web:FullCountryInfo>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Error full country info empty ISO code",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:FullCountryInfo>\r\n            <web:sCountryISOCode></web:sCountryISOCode>\r\n        </web:FullCountryInfo>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Error full country info wrong register",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:FullCountryInfo>\r\n            <web:sCountryISOCode>by</web:sCountryISOCode>\r\n        </web:FullCountryInfo>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Language name",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:LanguageName>\r\n            <web:sISOCode>Belarus</web:sISOCode>\r\n        </web:LanguageName>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Error ISO code is empty",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:LanguageName>\r\n            <web:sISOCode></web:sISOCode>\r\n        </web:LanguageName>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "Error ISO code is special symbol",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<x:Envelope\r\n    xmlns:x=\"http://schemas.xmlsoap.org/soap/envelope/\"\r\n    xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    <x:Header/>\r\n    <x:Body>\r\n        <web:LanguageName>\r\n            <web:sISOCode>?</web:sISOCode>\r\n        </web:LanguageName>\r\n    </x:Body>\r\n</x:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
					"protocol": "http",
					"host": [
						"webservices",
						"oorsprong",
						"org"
					],
					"path": [
						"websamples.countryinfo",
						"CountryInfoService.wso"
					],
					"query": [
						{
							"key": "WSDL",
							"value": null
						}
					]
				}
			},
			"response": []
		}
	]
}